import React from 'react';
import Image from 'next/image';
import Dots from '../svg/dots';
import bg from '@/assets/img/bg/team_details_bg.jpg';
import t_d_img_1 from '@/assets/img/team/team_details.jpg';
import t_d_img_2 from '@/assets/img/team/team_details01.jpg';
import t_d_img_3 from '@/assets/img/team/team_details02.jpg';

const TeamDetailsArea = () => {
  const imgStyle = {width:'100%',height:'auto'}
  return (
    <section className="team__details-area section-pt-120 section-pb-120" style={{backgroundImage:`url(${bg.src})`}}>
    <div className="container">
        <div className="row">
            <div className="col-12">
                <div className="team__details-img">
                    <Image src={t_d_img_1} alt="img" style={imgStyle}/>
                    <Dots/>
                </div>
                <div className="team__details-content">
                    <span className="sub-title">เล่นสล็อตออนไลน์ ได้เงินจริง ไม่ต้องลงทุนมาก</span>
                    <h2 className="title">เล่นสล็อตออนไลน์ ได้เงินจริง ไม่ต้องลงทุนมาก</h2>
                    <p>เป็นหนึ่งในประเด็นที่มีคนพูดถึง และพากันตั้งคำถามแน่นอน เพราะตามสถานการณ์ที่ได้กล่าวไปว่าในปัจจุบันนี้มีการเพิ่มขึ้นของทั้งนักเดิมพันหน้าใหม่ และ สล็อตออนไลน์ จำนวนมากพอตัวภายในระยะเวลาอันสั้น แต่เพราะสาเหตุอะไรที่ทำให้เหล่านักเดิมพันออนไลน์ทั้งมืออาชีพ และมือสมัครเล่น ถึงได้พากันหลั่งไหลเข้าไปเลือกเดิมพันออนไลน์กับ G2G168SA สล็อตออนไลน์
                    ในส่วนนี้จะขอทำการอธิบายถึงสาเหตุหลักที่คาดว่าน่าจะเป็นประเด็นที่น่าสนใจคือเรื่องของเกมสล็อตที่ให้บริการที่มีความครอบคลุมสูง หากจะให้พูดกันในฐานะของผู้บริโภค นักเดิมพันทุกคนทราบดีว่าเกมเดิมพันออนไลน์มีความหลากหลาย และแต่ละเกมเดิมพันมีอัตราในการจ่ายรางวัลที่ไม่เท่ากัน การเลือกเดิมพันกับเกมเดิมพันสักเกมจึงเป็นเรื่องที่เข้าใจได้ และเป็นกระบวนการแรกที่เหล่านักเดิมพันให้ความใส่ใจต่อการเล่น พวกเขาต้องการเว็บไซต์เดิมพันที่จะซื่อตรงต่อนักเดิมพัน และมีเกมเดิมพันที่ให้บริการเพียงพอต่อความต้องการ และตามข้อเท็จจริง เว็บไซต์เดิมพันออนไลน์เกมนี้สามารถที่จะตอบโจทย์ต่อความต้องการดังกล่าวได้</p>
                   
                    <blockquote className="team__details-quote">
                        <p>G2G168SA เดิมพันออนไลน์ครบวงจร หากท่านมองหาแหล่งวางเดิมออนไลน์สักแห่ง เงื่อนไขหนึ่งที่ท่านต้องการคงเป็นแหล่งเดิมพันที่ครบวงจร เมื่อเข้าไปแล้วสามารถหากิจกรรมเดิมพันที่ต้องการได้หลากหลายแบบในครั้งเดียว และที่สำคัญคือต้องตอบรับความต้องการวางเดิมพันที่มีทุนน้อยด้วย G2G168SA จึงเป็นอีกหนึ่งผู้ให้บริการ ที่เปิดตัวมาเพื่อตอบสนองในความต้องการของท่านโดยเฉพาะ และมีเหตุผลหลายข้อที่ท่านต้องหยุดเพื่อเข้ามาทำความรู้จักกับแหล่งเดิมพันออนไลน์แห่งนี้อีกสักนิดเสียก่อน</p>
                        <cite>G2G168SA</cite>
                    </blockquote>
                    <p>เมื่อถามถึงจุดเด่นของแหล่งเป็น เว็บสล็อต ที่จะดึงดูดให้นักเดิมพันให้เข้าหาเป็นจำนวนมาก ย่อมเป็นเรื่องผลกำไรที่จะได้รับเมื่อวางเดิมพันไปแล้ว และเว็บเดิมพันออนไลน์ที่สามารถตอบสนองความต้องการในข้อนั้นของลูกค้าได้ย่อมได้ใจลูกค้าเป็นอย่างมาก และทาง </p>
                    <div className="team__details-inner-wrap">
                        <div className="row">
                            <div className="col-sm-6">
                                <div className="team__details-inner-img">
                                    <Image src={t_d_img_2} alt="img" style={imgStyle}/>
                                </div>
                            </div>
                            <div className="col-sm-6">
                                <div className="team__details-inner-img">
                                    <Image src={t_d_img_3} alt="img" style={imgStyle}/>
                                </div>
                            </div>
                        </div>
                    </div>
                    <p>G2G168SA เองก็พร้อมตอบสนองความต้องการข้อนั้นของท่านตลอดเวลาเช่นกัน นอกเหนือจากนี้ท่านจะได้รับเมื่อได้มาเข้าร่วมเป็นสมาชิกท่านจะได้รับสิทธิประโยชน์อื่น ๆ ซึ่งเชื่อว่าท่านจะต้องประทับใจกับบริการที่มอบให้ท่านอย่างแน่นอน ไม่ว่าจะเป็น</p>
                </div>
            </div>
        </div>
    </div>
</section>
  );
};

export default TeamDetailsArea;